{"data":{"site":{"siteMetadata":{"title":"Intelligible Babble","author":"Leland Richardson"}},"markdownRemark":{"id":"51ff9465-9841-5e2b-9c2b-9c1a8fb5d3e6","excerpt":"Last week was the week of Google I/O 2019. It was a particularly exciting I/O for me, as it was the first time Google has talked publicly…","html":"<p>Last week was the week of Google I/O 2019. It was a particularly exciting I/O for me, as it was the first time Google has talked publicly about <a href=\"http://d.android.com/jetpackcompose\">Jetpack Compose</a>, the project I was hired to work on in February of 2018.</p>\n<p>Compose is an ambitious multi-team effort to reimagine Android’s UI Toolkit more than 10 years after the Android Platform launched with the original UI Toolkit.</p>\n<p>If you haven’t yet watched the <a href=\"https://www.youtube.com/watch?v=VsStyq4Lzxo\">session on Declarative UI Patterns</a>, you should do that now. It is a proper overview of the motivations and goals behind the project.</p>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/VsStyq4Lzxo\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>Compose is <em>extremely early</em>. It is currently “pre-alpha” (if that’s a thing?), which essentially means that it’s nowhere near done, pretty much everything is subject to change, and we make absolutely no guarantees around API stability. For now, we ask that you <strong>do NOT use Compose in your production apps until we say it is ready</strong>.</p>\n<p>One might ask:</p>\n<p><em>If this is the case, why even open source it?</em></p>\n<p>One reason we decided to open source Compose in such an early state is because in many ways, moving over to it will represent a <strong>paradigm shift in terms of UI development on Android</strong>, and we wanted to get the community used to the ideas embodied by this new framework.</p>\n<p>Keep in mind, however, that if all of this talk of change overwhelms you or concerns you, <em>don’t worry</em>. There is <em>no need for you to learn any of this now</em>, and there is a long time between now and when Compose will be the default way to do Android UI development.</p>\n<p>I am planning on writing several blogs about Compose’s architecture and doing technical deep dives around parts of the architecture that I think are interesting or useful for the community to understand. Writing takes time though, and some of these first articles I want to make sure and get right! In the meantime, there seems to be a lot of interested folks in the Android community that are eager to understand more about this new direction.</p>\n<p><a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/511b0ddca3403893954a6bbe7d48c044/0cb56/N6Q4yERuU9K.png\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n    <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 19.578622816032887%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAECAYAAACOXx+WAAAACXBIWXMAAAsSAAALEgHS3X78AAAAnUlEQVQY04WOzQrCMBCE8/7v4dGb+Ca2hVoEbSJJoZsfmuTUaRNNUC8ufOzOLLMsE1cBdTrCnQ+g+w3aOlhjYN5o0tBa59laW/2iaSZIKbP23oNdmgZN22HoWgx9D6VUPfBL8oko90LZpWMxRjBHM55C4ME5xpGD732aJjjn6kdlTqEQQiaFE0WXHcNer/cNwm4uy/KF//DWdcW/2gC/fDEzd0GydwAAAABJRU5ErkJggg=='); background-size: cover; display: block;\"\n    ></span>\n    <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n        alt=\"slack chat\"\n        title=\"\"\n        src=\"/static/511b0ddca3403893954a6bbe7d48c044/d7711/N6Q4yERuU9K.png\"\n        srcset=\"/static/511b0ddca3403893954a6bbe7d48c044/a695b/N6Q4yERuU9K.png 148w,\n/static/511b0ddca3403893954a6bbe7d48c044/2f273/N6Q4yERuU9K.png 295w,\n/static/511b0ddca3403893954a6bbe7d48c044/d7711/N6Q4yERuU9K.png 590w,\n/static/511b0ddca3403893954a6bbe7d48c044/5e66f/N6Q4yERuU9K.png 885w,\n/static/511b0ddca3403893954a6bbe7d48c044/466de/N6Q4yERuU9K.png 1180w,\n/static/511b0ddca3403893954a6bbe7d48c044/76253/N6Q4yERuU9K.png 1770w,\n/static/511b0ddca3403893954a6bbe7d48c044/0cb56/N6Q4yERuU9K.png 1946w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n  </span>\n  </a></p>\n<p>A few people have asked me what kind of things they can read or watch to better understand the programming model of Compose in the meantime. Compose has been influenced by many existing frameworks including, but not limited to, <a href=\"https://reactjs.org/\">React</a>, <a href=\"https://fblitho.com/\">Litho</a>, <a href=\"https://vuejs.org/\">Vue</a>, and <a href=\"https://flutter.dev/\">Flutter</a>. As many already know, I have a strong background with the React community, so I thought I would put together a list of links to talks or articles from folks in the React community that have really influenced my thinking around these paradigms.</p>\n<p>I think these should be helpful to those looking to really understand the programming model of Compose. While Compose is architecturally pretty different from React in terms of implementation, the programming model and mental model are very similar.</p>\n<h2>Rethinking Best Practices - Pete Hunt</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/x7cQ3mrcKaY\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>I believe this was the 2nd public talk given about React. The first public talk announcing react was met with a lot of skepticism and public backlash. This talk does a great job describing the thinking behind React, and the problems it solves, at a time where writing UI in the way that you do with React was very new and not well understood. Keep in mind while watching this that it is directed primarily at a “web” crowd.</p>\n<h2>Why does React Scale? - Christopher Chedeau</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/D-ioDiacTm8\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>This talk goes over some of the thinking behind React’s architecture that has been done specifically to make React scale for large organizations (solving the problems that facebook has). Some interesting points that you might not think of out of the bat.</p>\n<h2>‹Rethinker stop={false}/› - Ryan Florence</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/kp-NOggyz54\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>This is a great talk given by Ryan Florence that demonstrates some new ways to think about using React and creating pleasant APIs. Good demonstration and good discussion from a great public speaker.</p>\n<h2>Functional Principles In React - Jessica Kerr</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/1uRC3hmKQnM\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>If you’re not super familiar with functional programming, or maybe even you are, but it’s not clear why React is “functional” (it kind of looks like OOP), this is a great talk to explain the “functional” side of react, and why it’s a good thing. The concepts for Compose are somewhat similar, though Compose utilizes functions as Components whereas React’s functions at the time of this talk were stateless.</p>\n<h2>Pure UI - Guillermo Rauch</h2>\n<p><a href=\"https://rauchg.com/2015/pure-ui\">Link</a></p>\n<p>Great overview and explanation of the benefits of building UIs composed of components.</p>\n<h2>Live React: Hot Reloading with Time Travel - Dan Abramov</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/xsSnOQynTHs\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>This video was the announcement of <a href=\"https://redux.js.org/\">redux</a>, which Dan Abramov made for this talk. It goes into a lot of the thinking behind it and how it was different from flux. He also demonstrates “hot reloading” and some really innovative developer tooling at the time.</p>\n<h2>React Today and Tomorrow - Sophie Alpert and Dan Abramov</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/V-QO-KO90iQ\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>This talk was given as an introduction to a recently added feature to React: Hooks. Compose has a concept similar to Hooks which we call Effects, though hooks themselves may end up unifying with <code class=\"language-text\">@Composable</code> functions. More on this later. In any event, the motivations behind them and the patterns they enable are important for React and will be for Compose as well.</p>\n<h2>90% Cleaner React With Hooks - Ryan Florence</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/wXLf18DsV-I\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>This talk was given immediately after the former, and I think is a good introduction to using Hooks in practice and demonstrating their value. Some of the pain people are feeling here might be React-specific, but it’s worth a watch regardless.</p>\n<h2>A Complete Guide to useEffect - Dan Abramov</h2>\n<p><a href=\"https://overreacted.io/a-complete-guide-to-useeffect/\">Link</a></p>\n<p>Hooks have a bit of a learning curve, requiring you to think of Function Components (and <code class=\"language-text\">@Composable</code> functions in Compose) in a little bit of a different light than traditional functions. Dan, as always, does an excellent job explaining how to think about these things, and in particular, the <code class=\"language-text\">useEffect</code> hook, which is analogous to the <code class=\"language-text\">onCommit</code> effect in Compose.</p>\n<h2>React as a UI Runtime - Dan Abramov</h2>\n<p><a href=\"https://overreacted.io/react-as-a-ui-runtime/\">Link</a></p>\n<p>This is an excellent medium-to-deep-dive on React’s architecture, as well as a good overview of how to think different parts of the library working together. Not all of it maps directly to elements of Compose, but generally speaking I think it’s a good primer if you’re interested in learning more about this stuff.</p>\n<h2>Cross-Language React - Me</h2>\n<iframe \n  style=\"width:100%;height:320px;\" \n  src=\"https://www.youtube.com/embed/eR4LjL1h6cE\" \n  frameborder=\"0\" \n  allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" \n  allowfullscreen\n></iframe>\n<p>So I might be a little bit biased here but… this was a talk I gave right as I started working on Compose at Google, and it really is a talk about a project I was working on (building a React-like framework in Kotlin and Swift) before coming to Google. I go over some concepts here that I believe could be useful to those looking to understand Compose a bit better.</p>\n<hr>\n<p>That’s all I’ve got for now. There’s a <em>ton</em> of great material out there, and this is by no means an exhaustive list. These are just a few of the items that have been particularly impactful for me. I hope that some others might find it useful.</p>\n<p>Stay tuned for some content from me talking about Compose’s architecture directly!</p>","fields":{"readingTime":{"text":"7 min read"}},"frontmatter":{"title":"Content on Declarative UI","date":"May 16, 2019"}}},"pageContext":{"slug":"/content-on-declarative-ui/","previous":{"fields":{"slug":"/one-concern-one-file/"},"frontmatter":{"title":"One Concern, One File"}},"next":null}}