{
  "data": {
    "site": {
      "siteMetadata": {
        "title": "Intelligible Babble",
        "author": "Leland Richardson"
      }
    },
    "markdownRemark": {
      "id": "f6d44b03-a44c-5519-a9e0-8b29dd4d1426",
      "excerpt": "Rethinking Best Practices: Pete Hunt (Conference Talk) ( https://youtu.be/x7cQ3mrcKaY )\nThis was the 2nd public talks given about React. The…",
      "html": "<p>Rethinking Best Practices: Pete Hunt (Conference Talk) (<a href=\"https://youtu.be/x7cQ3mrcKaY\">https://youtu.be/x7cQ3mrcKaY</a>)\nThis was the 2nd public talks given about React. The first public talk about react was met with a lot of skepticism and public backlash. This talk does a much better job describing the thinking behind React, and the problems it solves, at a time where writing UI in the way that you do with React was very new and not well understood.  Keep in mind while watching this that it is directed primarily at a “web” crowd.</p>\n<p>OSCON 2014 – React’s Architecture (Conference Talk) (<a href=\"https://youtu.be/eCf5CquV_Bw\">https://youtu.be/eCf5CquV_Bw</a>)\nGood talk going over some of the origin of react, and some of the architectural decisions there.</p>\n<p>Christopher Chedeau: Why does React Scale? (Conference Talk) (<a href=\"https://youtu.be/D-ioDiacTm8\">https://youtu.be/D-ioDiacTm8</a>)\nThis talk goes over some of the thinking behind React’s architecture that has been done specifically to make React scale for large organizations (solving the problems that facebook has). Some interesting points that you might not think of out of the bat.</p>\n<p>Ryan Florence - ‹Rethinker stop={false}/› (Conference Talk) (<a href=\"https://youtu.be/kp-NOggyz54\">https://youtu.be/kp-NOggyz54</a>)\nThis is a great talk given by Ryan Florence that demonstrates some new ways to think about using React. Good demonstration and good discussion from a great public speaker.</p>\n<p>Jessica Kerr - Functional Principles In React (Conference Talk) (<a href=\"https://youtu.be/1uRC3hmKQnM\">https://youtu.be/1uRC3hmKQnM</a>)\nIf you’re not super familiar with functional programming, or maybe even you are, but it’s not clear why React is “functional” (it kind of looks like OOP), this is a great talk to explain the “functional” side of react, and why it’s a good thing :)</p>\n<p>Guillermo Rauch - Pure UI (<a href=\"https://rauchg.com/2015/pure-ui\">https://rauchg.com/2015/pure-ui</a>)\nClear expression of the benefits of building UIs composed of components.</p>\n<p>Dan Abramov - Live React: Hot Reloading with Time Travel (Conference Talk) (<a href=\"https://youtu.be/xsSnOQynTHs\">https://youtu.be/xsSnOQynTHs</a>)\nThis video was the announcement of redux, which Dan Abramov made for this talk. It goes into a lot of the thinking behind it and how it was different from flux. Really great talk.</p>\n<p>React Today and Tomorrow - Sophie Alpert and Dan Abramov - React Conf 2018</p>\n<p>90% Cleaner React With Hooks\n<a href=\"https://www.youtube.com/watch?v=wXLf18DsV-I&#x26;t=1s\">https://www.youtube.com/watch?v=wXLf18DsV-I&#x26;t=1s</a></p>",
      "fields": { "readingTime": { "text": "2 min read" } },
      "frontmatter": { "title": "React Links", "date": "May 13, 2019" }
    }
  },
  "pageContext": {
    "slug": "/react-links/",
    "previous": {
      "fields": { "slug": "/one-concern-one-file/" },
      "frontmatter": { "title": "One Concern, One File" }
    },
    "next": {
      "fields": { "slug": "/compose-from-first-principles/" },
      "frontmatter": { "title": "Compose From First Principles" }
    }
  }
}
