{
  "data": {
    "site": {
      "siteMetadata": {
        "title": "Intelligible Babble",
        "author": "Leland Richardson"
      }
    },
    "markdownRemark": {
      "id": "3434128c-4d80-5053-afdc-7bf1def6dbfd",
      "excerpt": "The mobile device landscape is changing quickly. At the end of 2013 there were 1.4 billion smartphone users globally, with predictions that…",
      "html": "<p>The mobile device landscape is changing quickly. At the end of 2013 there were 1.4 billion smartphone users globally, with predictions that we will break 2 billion next year.</p>\n<p>The “smart phone” is no longer a phone at all; it is a mobile <em>device</em>.  I’m not sure exactly when the transition from phones being something we—you know—<em>called</em> people on, to being everyone’s go-to electronic device to do pretty much anything happened, but it happened.</p>\n<p>I now use my phone to deposit checks. To send and read email. To look at my schedule. To monitor the quality of my sleep. To listen to music. To navigate my way across country. To control my TV. To find and consume news. To hail cabs and order food (<em>without</em> actually calling anyone). And of course, to call and text message friends.</p>\n<p>This is literally only an incomplete list of how <em>I myself</em>  use my phone. (Notice how the word “phone” just doesn’t seem right anymore?).  If I were to enumerate a complete list of uses people have found for smart phones, it would take me forever.</p>\n<p>Despite these recent advances, the world of mobile devices is about to change—drastically.</p>\n<h2>From “App” to “Module”</h2>\n<hr>\n<p><img src=\"http://tpstatic.com/img/usermedia/s9POCUkw9EGdJhd3t9nDUg/w645.png\" alt=\"Dear Industry, Please make this\"></p>\n<p>In September of 2013, <a href=\"http://news.davehakkens.nl/\">Dave Hakkens</a> posted a <a href=\"https://www.youtube.com/watch?v=oDAw7vW7H0c\">video on YouTube</a> with an appealing modular phone concept, and the simple message:</p>\n<blockquote>\n<h3>Dear Industry, Please make this.</h3>\n</blockquote>\n<p>Over the next month the video went viral, and hardware geeks all over the world started wondering whether or not a device like this could actually become a reality.</p>\n<p>The idea behind a “Modular” phone is to have a device where all of the major components (Processor, Memory, Hard Drive, Screen, Camera, etc) are all removeable and replaceable. Even more, there would be entire new types of components (ie, “Modules”) which could unleash new potential from your phone that current phones don’t have. Of course there are other more obvious benefits such as being able to replace a broken screen, or upgrade parts incrementally as they become outdated.</p>\n<p>Since the phonebloks video was merely a concept, many people were quick to point out how difficult—or more accurately impossible—building a phone like this would be.  But of course, like so many of the most important technological revolutions, they start with an idea that, to most, seems <em>impossible</em>.</p>\n<p>Coincidentally, Motorola, owned by Google at the time, had already been working on a remarkably similar modular phone concept in an R&#x26;D group named ATAP, under the name of “Motorola Ara” (now, officially ”<a href=\"http://www.projectara.com/\">Google Ara</a>”).</p>\n<p>Although <a href=\"http://www.theverge.com/2014/1/29/5358620/lenovo-reportedly-buying-motorola-mobility-from-google\">Google sold Motorola to Lenovo earlier this year</a>, with the company’s obsession over “moonshot” ideas, it of course made sure to keep the <a href=\"https://plus.google.com/+GoogleATAP/videos\">ATAP department</a> of Motorola under Google’s arm.</p>\n<p>Keeping ATAP was no accident; Google sees “moonshot” potential in bringing modular phones to the world.</p>\n<h2>History as our teacher</h2>\n<hr>\n<p><img src=\"http://tpstatic.com/img/usermedia/7GJUBavmM0aD3pV2pj0AnQ/w645.png\" alt=\"enter image description here\"></p>\n<p><em>Steve Jobs shows the iPhone to the world, January 9, 2007. (outsidethebeltway.com)</em></p>\n<p>Do you remember when you saw the iPhone for the first time? The iPhone revolutionized cell phone designs, and phones have been only iteratively different ever since.  Chances are, the phone in your pocket really doesn’t look much different than the original iPhone Jobs is holding above.</p>\n<p>But a lot <em>has</em> changed since then. Apps. It’s all about the apps.</p>\n<h3>The “App” Revolution</h3>\n<p>Although the iPhone’s hardware and physical design was radically different than it’s competitors at the time, the <em>real</em> revolution was that of a <em>software</em> revolution, not a hardware one.</p>\n<p>I don’t even remember using the <em>word</em> “app” before the App Store existed. These days it is part of our every vocabulary.</p>\n<p>Before the iPhone there was no platform to build sophisticated mobile software on. None. The operating systems were abysmal, widely varied, and vendor specific. Not to mention that without a rich input device like a touch screen, there wasn’t much you could do in the first place.</p>\n<p><img src=\"http://tpstatic.com/img/usermedia/hnj7GPKYTkqT9zPN8M6B-w/original.png\" alt=\"enter image description here\"></p>\n<p><em>Source: <a href=\"http://www.asymco.com/2011/01/16/more-than-60-apps-have-been-downloaded-for-every-ios-device-sold/\">asymco.com</a></em></p>\n<p>The App Stores of Google and Apple changed the software landscape forever. Before App Stores, I wouldn’t have dreamed of people <em>installing software</em> at rates double that of <em>downloading music</em>.</p>\n<p>The App Store was able to change the psychology of it all. Not only do people expect to be able to download and install software with a single tap, but developers are now expecting to sling a couple of lines of Objective-C or Java (or Swift?) and in a matter of days have thousands—if not millions—of users.</p>\n<h2>The “Module” Revolution</h2>\n<hr>\n<p>Nowadays everyone is talking about <a href=\"http://en.wikipedia.org/wiki/Internet_of_Things\">The Internet of Things</a>.  Just like software needed a revolutionary platform like the App Store + Mobile Devices, now hardware needs the same. </p>\n<h3>Sensors. Sensors. Sensors.</h3>\n<p>It turns out, our mobile devices are essentially a “bag of sensors” already.  Think about it… a standard smartphone comes with:</p>\n<ul>\n<li>GPS Sensor</li>\n<li>Microphone</li>\n<li>Touch screen</li>\n<li>Accelerometer</li>\n<li>Digital Camera (multiple, probably)</li>\n<li>Thumbprint reader (iPhone 5)</li>\n</ul>\n<p>That’s a decent list.  It turns out that this group of sensors is widely-applicable enough (or cheap enough) to be included in a mobile-device intended and marketed for… pretty much everybody.</p>\n<p>But certainly, there are more sensors than this that can be useful, right? Of course there are! There are viable markets for all kinds of more exotic and/or expensive sensors that could be unleashed with a modular phone. Just naming a couple:</p>\n<p><strong>“Studio Quality” Condensor Microphones</strong><br>\nHome-studio recording already has market-mass in the laptop realm, it’s obvious that mobile is next. Of course, quality microphones can cost hundreds of dollars and we will never see them as built-in peripherals on a smartphone. Brands like Shure and Sennheiser would be ALL over this.</p>\n<p><strong>Higher-quality Cameras</strong><br>\nPhones like the Nokia Lumia 1020 with a 41 megapixel camera on it already demonstrate the powerful market of cell phone cameras.  For the serious point-and-shoot photographers out there, dishing out some extra cash for the better camera module is an easy decision. In the world of modular phones, companies like Kodak, Canon, Sony, and Nikon will all be able to compete with each other for the “best camera module”.</p>\n<p><strong>Water Purity Sensor</strong><br>\nQuality drinking water is low supply across most of the world, and is a massive problem we are facing. As Google’s vision for Project Ara is to be the “phone for the next 5 billion”, it would just be good sense to make a nice, cheap water sensor to put on it since it will be modular… right?!</p>\n<p><strong>Voltmeter / Multimeter</strong><br>\nWhat hardware geek hasn’t already wanted this at some point in their lives?</p>\n<p><strong>Blood / Glucose Testing</strong><br>\nPerhaps lowering the barrier of entry for hardware-based hacking on phones will finally create user-friendly devices for those who suffer from Type 1 diabetes. This disease affects as many as 3 million in the US alone, and most check their blood sugar 10 times per day or more.  <a href=\"http://www.hanselman.com/\">Scott Hanselman</a> has <a href=\"http://www.hanselman.com/blog/HackingDiabetes.aspx\">written extensively</a> on the <a href=\"http://www.hanselman.com/blog/TheSadStateOfDiabetesTechnologyIn2012.aspx\">problems in this area</a>. </p>\n<p>This is just one disease of many the sufferers of which could have changed lives from a revolution in specialty hardware brought on by an exceedingly low barrier to entry that a modular smart phone could bring.</p>\n<p><strong>Credit Card Reader</strong><br>\nObviously we already have Credit card readers like <a href=\"https://squareup.com/\">Square</a>… but piping significant amounts of data through the headphone jack can actually be quite challenging. Giving hardware vendors the ability to build these devices as modules instead would be much easier.</p>\n<p><strong>3D Motion / Depth Sensor</strong><br>\nGoogle already seems to be doing this with <a href=\"https://www.google.com/atap/projecttango/#project\">Project Tango</a>, but putting this into an optional module rather than building it into the phone seems much more practical to me…  For one, not everyone is going to want to shell out the extra cash for phone with a sensor like this.</p>\n<p><img src=\"http://tpstatic.com/img/usermedia/LSoqRR1fH0WK_iOCtN5lTQ/w645.png\" alt=\"enter image description here\"></p>\n<p>*Google’s <strong>other</strong> smartphone project, “Project Tango”, puts 3D sensors on a phone*</p>\n<p><strong>Geiger counter</strong><br>\nI’m not very familiar with everyday issues that the military faces, but something tells me that there is value in a soldier having a single multi-capable handheld device, with one screen, one battery, and one CPU… and lot’s of modules, versus carrying several individual devices. A geiger counter is one such sensor of what I assume is a much longer list.</p>\n<h3>It’s not about giving consumers choice. It’s about giving vendors a voice.</h3>\n<p>Most proponents of the modular phone seem to tout one thing above all: <strong>choice</strong>.</p>\n<p>Choice is—of course—a big advantage of the modular design. Marketing wise, this has very easy-to-understand mass-appeal, but I think it actually frames it the wrong way.</p>\n<p>The reason this phone is compelling is because it starts to let hardware vendors fend for themselves. It provides a platform for vendors to sell hardware directly to the consumer.  More importantly, it allows vendors to sell <em>niche</em> hardware to <em>niche</em> markets.</p>\n<p>This is incredibly important and is directly analogous to the success of “Apps” in the software realm.</p>\n<p>Today the app store has many success stories. There are mega-corporations as well as startups competing on relatively equal footing. I believe the future is in having the same ubiquity for hardware.</p>\n<p>Right now smart phones are predominantly made by Samsung and Apple.  Hardware vendors must work with just a handful of companies in order to get into a mobile device they are likely to see in a store.  Now let’s imagine what a world with modular mobile devices might look like.</p>\n<p><strong>Massive Hard Drives</strong><br>\nTake a lot of videos on your phone? Need a bigger hard drive?  You could buy a new 1TB Hard Drive module from Western Digital or Seagate. Not to mention that you could buy <em>multiple</em> hard drives and swap them out like SD cards whenever they got full.</p>\n<p><strong>E-Ink Displays</strong><br>\nEver get frustrated with the glare on your phone while trying to read something outside?  Perhaps <a href=\"http://www.eink.com/\">E-Ink</a>, the company that makes paper-like displays for the Amazon Kindle, will make a screen that you can switch out with your normal display while reading. Saving your eyes, and your battery.</p>\n<p><strong>Hardcore Gaming</strong><br>\nMobile devices are taking over more and more of the gaming market. Inevitably, companies like nVidia or ATI could make standalone GPUs that could supercharge your mobile device into a gaming platform to be reckoned with.</p>\n<p><strong>Real Barcode Scanners</strong><br>\nWe’ve used cameras to do this, but they still never really work great. I’d be surprised if we didn’t see an “Amazon Dash” functional equivalent in the form of a module.</p>\n<p><strong>Mini Projectors</strong><br>\nTurn your phone into a full-on media viewing experience for the whole family with a Pico-Projector module. These devices are hard to get right, and the companies that make them would have a perfect new market to exploit.</p>\n<h2>Why Modular? Why Now?</h2>\n<hr>\n<p><img src=\"http://tpstatic.com/img/usermedia/3A_3A1liNkikHZOZYTyzwA/w645.png\" alt=\"enter image description here\"></p>\n<h3>Phones are getting bigger, not smaller</h3>\n<p>There was a time when perhaps the determining factor of a phone’s appeal was how small it was. Many wondered how small phones would actually get before some limit was met.</p>\n<p>There are two primary reasons this trend never went too far: </p>\n<ol>\n<li><strong>The size of our fingers is constant</strong>. We <em>at least</em> need to be able to type in a phone number…</li>\n<li><strong>Phones became media consumption devices</strong>. When consuming media: the bigger the screen, the better.</li>\n</ol>\n<p><img src=\"http://tpstatic.com/img/usermedia/40OdUtCnTkGmgybWa6Deaw/w645.png\" alt=\"enter image description here\"></p>\n<p>*Phones are steadily <strong>growing</strong> in size, not shrinking. (source: <a href=\"http://gizmodo.com/a-comprehensive-look-into-the-future-of-smartphone-scre-1583303782\">gizmodo</a>)*</p>\n<p>As technology advanced, smart phones grew in size rather than shrinking. This is largely due to screens getting larger, cheaper, and thinner. Although this trend doesn’t exactly demonstrate that space is in excess, it shows that consumers don’t prefer smaller phones; they prefer phones which they can <em>do more</em> with.</p>\n<p>Note: Although screen size has consistently increased, bezel size has consistently <em>decreased</em>.</p>\n<h3>But doesn’t Modular mean Overhead?</h3>\n<p>It doesn’t take an electrical engineer to come to the conclusion that making cell phones modular could come with a significant amount of overhead.</p>\n<p>John Gruber <a href=\"http://daringfireball.net/linked/2014/04/15/project-ara\">summed it up nicely</a>:</p>\n<blockquote>\n<p><em>I remain highly skeptical that a modular design can compete in a product category where size, weight, and battery life are at such a premium.</em></p>\n</blockquote>\n<p>Although I agree that size, weight, and battery life are very important in the mobile market, I feel Gruber is perhaps dismissing the idea a little bit too quickly. (In fact, I think he may be missing the whole value proposition to begin with.)</p>\n<p>That being said, size and weight may not be in as much demand as they once were (battery life, on the other hand, is very hard to argue with).</p>\n<h1>Enter Project Ara: Google’s Modular Phone</h1>\n<hr>\n<p><img src=\"http://tpstatic.com/img/usermedia/wp3fSH33w0mK0WuCIL2BBA/w645.png\" alt=\"enter image description here\"></p>\n<p>Google is attempting to make this modular phone a reality, and I am quite impressed with what has been done so far.  Ara’s physical design is simply brilliant.  The customizable pebble-like modules add beauty to the phone and embraces it’s modular design, rather than trying to hide it and be something that it is not.</p>\n<p>Each module is smooth, and need not have any moving parts. The modules are held in place by the metal endo-skeleton and special Electropermanent Magnets (EPMs) and connected through a unique metal frame.</p>\n<p>This is not a rendering, nor some PR pipe-dream that Google is fooling us with.  The Project Ara team plans to have a consumer version ready by January, and has already released a <a href=\"https://www.google.com/atap/projecttango/#project\">Module Developer Kit</a> with staggering amounts of technical detail.</p>\n<p><img src=\"http://tpstatic.com/img/usermedia/gB0FdfmfCE-SqUvcDjHoNA/w645.png\" alt=\"enter image description here\"></p>\n<h3>Ara’s key ingredients: The “Endo”, UniPro, and UniPort</h3>\n<p>The metal backplane that each device has, with the receiving ports for all of the modules, is called an “Endo”.  The Endo is critical to Ara’s design. Not only does the metal frame provide a structural backbone for the phone physically, it critically acts as the “bridge” for all of these modules to communicate with one another.</p>\n<p>Once you start thinking about how to build a truly modular phone, you start to realize how <em>difficult</em> that is.  Think about all of the components that go into a phone: Processor, RAM, Hard Drive, Screen, Camera, Battery, etc.  Now think about the fact that every single “slot” in the Endo needs to be capable of interfacing with every single one of those components.  That is an engineering <em>nightmare</em>.</p>\n<p>Surprisingly enough, there was a protocol specification that was already in use on several phones that already connected about 50% of the components needed: <a href=\"http://mipi.org/uniport-m-high-level-overview\">UniPort</a> (aka <a href=\"http://en.wikipedia.org/wiki/UniPro\">UniPro</a> over M-PHY).  Of course, that doesn’t mean the work was done by any stretch. Google has been working with Toshiba for over a year now trying to get all of these components working together over this UniPro protocol, but also to build the hardware to do it with the physical constraints given.</p>\n<p>The connectors needed to make the Ara phone possible are new connectors innovated by the Ara team themselves in collaboration with Toshiba.  The connectors need to be durable and small while allowing up to 5 watts of power transmission and 10 Gbps.  The exact specification of these connectors is set to come out in the next MDK release, but more details about it’s current state are available from the Ara Developer’s conference video.</p>\n<p><img src=\"http://tpstatic.com/img/usermedia/ieGZU43hl0qKVcceOfojhw/w645.png\" alt=\"enter image description here\"></p>\n<h3>Designed exclusively for 6 billion people</h3>\n<p>Indeed on the front page of Project Ara’s website, it ends with the simple but bold tag line: “Designed exclusively for 6 billion people”.  I love how that sentence can sound both greedy and altruistic at the same time.</p>\n<p>The reason Google is making such claims is that the Modular phone design inadvertently creates a <em>new product</em> for Google: The Grey Phone.</p>\n<p>The Grey Phone is what Google is calling the “barebones” version of the Project Ara phone. The thought is that with the modular design, someone would be able to have an internet-capable smart phone—albeit with not-so-revolutionary specs—for just $50.  This is roughly the cost needed in order to disrupt the feature-phone market. The feature-phone market, by the way, is still <em>booming</em> in many parts of the world, and represents 5 <em>billion</em> users globally.</p>\n<p>The compelling thought behind this is that over time, the user would be able to incrementally <em>upgrade</em> their phone by buying new modules, rather than buying an entirely new phone.</p>\n<h2>The challenges that lay ahead</h2>\n<hr>\n<p>I must point out that at least in the <em>near</em> future, Project Ara may still have the odds stacked against it. Before the first <a href=\"http://www.projectara.com/ara-developers-conference/\">Project Ara Developers Conference</a>, I had many doubts on the viability of such a device. After the conference, all but a few doubts were eliminated. I believe this is the right time for the “module” revolution, but I still have two big concerns:</p>\n<h3>Battery Life</h3>\n<p>I haven’t seen this issue addressed enough. The 2x2 module size for the Ara phone, especially once you account for the overhead of the connectors, is still too small to run a modern day smart phone long enough. I believe that the current “best bet” is that the screen module will also have a fairly significant battery in it as well.</p>\n<p>The main thing the phone will have going for it is that the batteries <em>are</em> replaceable… so at least users could carry around several batteries at once.</p>\n<p>There is also a possibility that new “Endo” designs will be made to incorporate batteries into the design. Since batteries are pretty much the one “required” module, I see this as a practical approach.</p>\n<p>Making batteries better is—and will continue to be—a “holy grail” of technology.  There are already many, many great minds thinking about this. The technological breakthrough has yet to come.</p>\n<h3>Smart phone makers lose brand cohesion</h3>\n<p>From what I can tell here, the main losers in this are going to be the actual current smartphone manufacturers. </p>\n<p>The smaller manufacturers outsource most of their hardware to other vendors.  Thus vendors will become Module makers, and then smartphone manufacturer will just become a sort of “middle man”.</p>\n<p>The larger manufacturers, like Samsung, make most of their own components anyway, and would theoretically continue to do so. The downside, however, is that if they choose to make modules, their brand is completely lost on the consumer in an “Ara” phone.</p>\n<p>Google has specified that they don’t want module manufacturers to put visible logos on their modules. Assuming people follow that spec, users are just going to see their phone as a whole.  When someone asks you what kind of a phone you have, what are you going to say?</p>\n<p>This would be a very interesting shift in the industry. I suspect that Google will push for the modular platform hard, since they clearly win by getting everyone on Android-powered devices, but all of the other smart phone manufacturers are going to be against it. </p>\n<p>What’s most interesting to me is that all of the hardware manufacturers that don’t currently have their “skin in the game” will probably be the companies who start participating in the market the quickest. Then, over time, I assume the other manufacturers will begrudgingly start playing along as well if it represents a sizable market that they are missing out on.</p>\n<h3>Interested in all this?  Here’s some links to check out:</h3>\n<ul>\n<li><a href=\"http://www.projectara.com/ara-developers-conference/\">Project Ara Developer Conference Videos</a></li>\n<li><a href=\"http://www.projectara.com/mdk/\">Project Ara Module Developer Kit (MDK) For Download</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=iLnM6j5-fXg\">Google Project Ara Demo at LAUNCH</a></li>\n<li><a href=\"http://www.fiercewireless.com/story/i-love-motorolas-project-ara-modular-phones-i-just-dont-think-it-will-work/2013-10-29\">I love Motorola’s Project Ara for modular phones - I just don’t think it will work</a></li>\n</ul>",
      "fields": { "readingTime": { "text": "17 min read" } },
      "frontmatter": { "title": "", "date": null }
    }
  },
  "pageContext": {
    "slug": "/the-future-of-mobile-is-modular-and-this-is-why/",
    "previous": {
      "fields": { "slug": "/text-headings/" },
      "frontmatter": { "title": "Just text and links" }
    },
    "next": {
      "fields": {
        "slug": "/generic-method-to-safely-perform-cross-thread-invoke/"
      },
      "frontmatter": { "title": "" }
    }
  }
}
