{
  "data": {
    "site": {
      "siteMetadata": {
        "title": "Intelligible Babble",
        "author": "Leland Richardson"
      }
    },
    "markdownRemark": {
      "id": "d58fc872-a2ba-5220-a006-7a65aed748f1",
      "excerpt": "Introduction JavaScript is a powerful, but misunderstood language. People like to say that it  is  an object oriented programming language…",
      "html": "<h2>Introduction</h2>\n<p>JavaScript is a powerful, but misunderstood language. People like to say that it <em>is</em> an object oriented programming language, or that it <em>is</em> a functional language.  Others like to say that it <em>isn’t</em> an object oriented programming language, or that it <em>isn’t</em> a functional language. One could say it’s sorta both—and also neither—but let’s set that debate aside for now.</p>\n<blockquote>\n<p>Let us pretend we are on a mission: a mission to write JavaScript using as many principles from Functional Programming as the language allows.</p>\n</blockquote>\n<p>This series of posts is meant to take you on that journey with me.  First, we need to clear up some incorrect conceptions about Functional Programming that might currently be in your head.</p>\n<h3>Functional Programming is (largely) Misunderstood in JS-land</h3>\n<p>Obviously there is a sizable group of developers that use functional paradigms in JavaScript day in and day out. I would say there is a much <em>larger</em> group of JavaScript developers that just don’t really understand what that means.</p>\n<p>I believe this is a result of the fact that most languages used for server-side web development have roots in C, which most would agree is <em>not</em> a functional programming language.</p>\n<p>There seem to be two levels of confusion.  The first level of confusion can be demonstrated by the following example of what might be considered common use of jQuery:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">$(&quot;.signup&quot;).click(function(event){\n    $(&quot;#signupModal&quot;).show();\n    event.preventDefault();\n});</code></pre></div>\n<p>Hey, look at that. We passed in an anonymous function as an argument, otherwise known in the JavaScript world as the infamous “callback” function.</p>\n<p>Some might call this functional programming.  Is it? <strong>Not at all!</strong></p>\n<p>This example <em>is</em> demonstrating one key feature of functional languages: functions as parameters. On the other hand, this example <em>also</em> goes against almost every other paradigm of functional programming that one can possibly go against in a 3 line example.</p>\n<p>The second level of confusion is a bit more subtle.  Reading this, several trendy JS developers are thinking to themselves: </p>\n<blockquote>\n<p>Well, duh! But I already know all about functional programming. I use Underscore.js in <em>all</em> my projects.</p>\n</blockquote>\n<p><a href=\"http://underscorejs.org/\">Underscore.js</a> is a wildly popular JavaScript library used all over the place. For the sake of example, let’s say I have a set of words, and I need the corresponding set of the first two characters of each word.  This is pretty straight-forward to do with Underscore.js:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">var firstTwoLetters = function(words){\n    return _.map(words, function(word){\n        return _.first(word, 2);\n    });\n};</code></pre></div>\n<blockquote>\n<p>See! Look at that JavaScript voodoo. I’m using these fancy functional utility functions like <code class=\"language-text\">_.map</code> and <code class=\"language-text\">_.first</code>.  What do you have to say to THAT, Leland?</p>\n</blockquote>\n<p>Although underscore and functions like <code class=\"language-text\">_.map</code> are useful functional paradigms, the way in which these are put together in this example just seem… verbose and hard to comprehend to me. Do we really need all this?</p>\n<p>If we start thinking of things just a little bit more “functionally”, perhaps we can take the above example and turn it into this:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">// ... a little bit of magic\nvar firstTwoLetters = map(first(2));</code></pre></div>\n<p>If you think about it, all of the same information is contained in this one line, as in the 5 lines above. <code class=\"language-text\">words</code> and <code class=\"language-text\">word</code> are just parameters/placeholders. The real meat of the logic is in combining the function <code class=\"language-text\">map</code>, the function <code class=\"language-text\">first</code>, and the constant <code class=\"language-text\">2</code> in a meaningful way.  </p>\n<p>Some of you may be looking at this example and thinking what this “little bit of magic” is. After all, putting any example with  a “a little bit of magic” comment above it is like… kind of cheating, isn’t it?</p>\n<p>Well, I’m gonna spend the next couple of posts explaining that “little bit of magic”, so if you’re at all intrigued, please continue on.</p>\n<p>This series of blog posts is here to help others learn how to borrow some of the beauty of functional programming languages in the context of JavaScript.</p>\n<p>In the next post, I will discuss the various elements of the JavaScript language that <em>are</em> functional, as well as those that aren’t.  With this knowledge, we will slowly piece together some of the fundamental building blocks of functional programming, and what they look like in JavaScript.</p>\n<h3>Up Next -> <a href=\"http://tech.pro/tutorial/2009/functional-javascript-part-2-what-makes-a-language-functional\">Part 2: What makes a language “functional”?</a></h3>\n<hr>\n<h3>More From This Series:</h3>\n<ul>\n<li><a href=\"http://tech.pro/tutorial/1953/functional-javascript-part-1-introduction\">Part 1: Introduction</a></li>\n<li><a href=\"http://tech.pro/tutorial/2009/functional-javascript-part-2-what-makes-a-language-functional\">Part 2: What makes a language “functional”</a></li>\n<li><a href=\"http://tech.pro/tutorial/2010/functional-javascript-part-3-apply-call-and-the-arguments-object\">Part 3: .apply(), .call(), and the arguments object</a></li>\n<li><a href=\"http://tech.pro/tutorial/2011/functional-javascript-part-4-function-currying\">Part 4: Function Currying</a></li>\n<li>Part 5: Variadic Functions (coming soon)</li>\n<li>Part 6: 2048 Game &#x26; Solver, a “practical” example (coming soon)</li>\n<li>Part 7: Lazy sequences / collections (coming soon)</li>\n<li>Part 8: Why Argument order matters (coming soon)</li>\n<li>Part 9: Functors and Monads (coming soon)</li>\n</ul>\n<h3>Translations of this article:</h3>\n<ul>\n<li><a href=\"http://habrahabr.ru/post/229893/\">Russian</a></li>\n</ul>",
      "fields": { "readingTime": { "text": "4 min read" } },
      "frontmatter": {
        "title": "Functional JavaScript, Part 1: Introduction",
        "date": "December 25, 2018"
      }
    }
  },
  "pageContext": {
    "slug": "/functional-javascript-part-1-introduction/",
    "previous": {
      "fields": { "slug": "/hello-world/" },
      "frontmatter": { "title": "Lets look at some code" }
    },
    "next": {
      "fields": {
        "slug": "/functional-javascript-part-2-what-makes-a-language-functional/"
      },
      "frontmatter": { "title": "Just text and links" }
    }
  }
}
