{
  "data": {
    "site": {
      "siteMetadata": {
        "title": "Intelligible Babble",
        "author": "Leland Richardson"
      }
    },
    "markdownRemark": {
      "id": "617c2aa9-56bd-5ffb-9245-8c9880fd1dcd",
      "excerpt": "As a web developer, CSS is incredibly important. There is nothing that users are quicker to judge than the style of a web application or web…",
      "html": "<p>As a web developer, CSS is incredibly important. There is nothing that users are quicker to judge than the style of a web application or web page. Yet, somehow CSS seems to take a backseat to other aspects of web development. An afterthought. Unimportant in the grand scheme of architecture and organization.</p>\n<p><em>That is just plain nonsense.</em></p>\n<p>While writing modular and “DRY” CSS has improved recently with the advent of CSS pre-processors such as SASS and LESS, I feel that proper “design patterns” for writing CSS at-scale is not discussed enough.</p>\n<p>In my time as a web developer, I have come to form several opinions on what to do and not to do when writing CSS for a large web application.  I’d like to discuss them here by first going over a design pattern I have come to find very useful for larger projects.</p>\n<h2>The “Widget Wrapper” Pattern</h2>\n<hr>\n<p>I have come to write CSS in a specific way to avoid some common pitfalls one might encounter on a large project over a long period of time. I call it, perhaps somewhat uncreatively, the “widget wrapper” pattern.</p>\n<p>Overall this method attempts to promote the following:</p>\n<ul>\n<li>CSS style rules that do not conflict with other rules</li>\n<li>clean, short, and legible <code class=\"language-text\">class=&quot;&quot;</code> attributes in your markup</li>\n<li>relatively short selectors, optimizing performance</li>\n<li>a modular, order-independent codebase</li>\n</ul>\n<p>To demonstrate this pattern, I will use LESS syntax for examples.  Although this pattern is in no way reliant to CSS pre-processing such as LESS, it is accomplished much more cleanly with LESS or SASS (or any other CSS pre-processor which allows selector nesting).</p>\n<p>To give you an example, let’s pretend we have a text editor widget. The style for such a widget might look like:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">.ns-editor {              // ← the widget&#39;s primary selector\n    ...\n    .input { ... }        // ← one of the rule-sets for the widget&#39;s &quot;sub-styles&quot;\n    .toolbar { ... }\n    .button { ... }\n    .preview { ... }\n}</code></pre></div>\n<p>This might be reflected by the following HTML:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;div class=&quot;ns-editor&quot;&gt;\n    &lt;ul class=&quot;toolbar&quot;&gt;\n        &lt;li class=&quot;button&quot;&gt;&lt;a&gt;Bold&lt;/a&gt;&lt;/li&gt;\n        &lt;li class=&quot;button&quot;&gt;&lt;a&gt;Italic&lt;/a&gt;&lt;/li&gt;\n        &lt;!-- ... --&gt;\n    &lt;/ul&gt;\n    &lt;textarea class=&quot;input&quot;&gt;&lt;/textarea&gt;\n    &lt;div class=&quot;preview&quot;&gt;&lt;/div&gt;\n&lt;/div&gt;</code></pre></div>\n<p>There are a couple of subtle choices being made here that might not immediately be obvious.</p>\n<h3>1. Sub-classes are simple/semantic. Widget-classes are namespaced/unique.</h3>\n<p>This maintains a balance between having short, convenient, and semantic class names while avoiding style conflicts with other parts of the codebase / website.</p>\n<p>An approach I commonly see is to prefix <em>all</em> styles with a contextual prefix, similar to the name of the widget. For example, if I have some widget, say a “site search” widget, I might have CSS rule-sets like the following:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">// don&#39;t do this\n.site-search { ... }\n.site-search-textbox { ... }\n.site-search-button { ... }\n.site-search-icon { ... }</code></pre></div>\n<p>Even worse, I might be using LESS or SASS, so I decide to nest these:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">// don&#39;t do this either\n.site-search { \n    ... \n    .site-search-textbox { ... }\n    .site-search-button { ... }\n    .site-search-icon { ... }\n}</code></pre></div>\n<p>This results in long and redundant class names.  Using the “widget wrapper” pattern, one would instead define this widget as:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">// do this\n.site-search { \n    ... \n    .textbox { ... }\n    .button { ... }\n    .icon { ... }\n}</code></pre></div>\n<p>In this case, the risk of conflicting with other styles is just as small as before, but now our rendered CSS is shorter, plus our markup and CSS code is easier to read and understand.</p>\n<p>The benefit of having all of these classes nested underneath the widget’s parent <code class=\"language-text\">.site-search</code> selector is that we can now use simple and semantic class names underneath, without concern of the same class-names being used in other widgets.</p>\n<p>For example, class names such as <code class=\"language-text\">.title</code>, <code class=\"language-text\">.image</code>, <code class=\"language-text\">.description</code>, <code class=\"language-text\">.name</code>, etc. are great class names and describe the type of content that their elements contain, but would normally be avoided when not using this pattern because of the high risk of conflicting styles made elsewhere with the same name.</p>\n<h3>2. Selector Nesting depth is minimized, but greater than 0</h3>\n<p>One must resist the temptation to overly nest things.  If you look closely, you will notice that in the <code class=\"language-text\">.ns-editor</code> example, the HTML has the <code class=\"language-text\">.button</code> elements nested under the <code class=\"language-text\">.toolbar</code> element. Despite this inherent structure in the HTML, we avoided nesting the classes in the LESS.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">// YES!\n.ns-editor {\n    ...\n    .toolbar { ... }\n    .button { ... }\n}\n\n// NO!!! resist the urge to nest!\n.ns-editor {\n    ...\n    .toolbar {\n        ...\n        .button { ... }\n    }\n}</code></pre></div>\n<p>There are several reasons to avoid this:</p>\n<ul>\n<li>\n<p>Nesting will result in overly specific selectors. Overly specific selectors result in poorer performance and larger stylesheets.</p>\n</li>\n<li>\n<p>Overly specific selectors are harder to override. This will come back to bite you in the butt later down the road.</p>\n</li>\n<li>\n<p>If your CSS is somehow inherently tied to the structure of the HTML, whenever you go to refactor your HTML a little bit, it is going to be a big pain to unwind all of the nesting to match the new structure. Relying only on one “wrapper” element, and a single class-name will make refactoring easy.</p>\n</li>\n</ul>\n<h3>3. Use class names over HTML tag names and #id selectors whenever possible.</h3>\n<p>Some debate usually ensues with this. Hell, I was even on the opposing side at one point. There are really two separate discussions here… <code class=\"language-text\">.class</code> selectors vs. <code class=\"language-text\">#id</code> selectors and <code class=\"language-text\">.class</code> selectors vs. <code class=\"language-text\">tag</code> selectors.</p>\n<p><strong>Why should I use a <code class=\"language-text\">.class-name</code> selector instead of an <code class=\"language-text\">#id-name</code> selector?</strong></p>\n<ul>\n<li>the <code class=\"language-text\">#id-name</code> selector has a high specificity, resulting in hard-to-override rule sets.</li>\n<li>there is little to no performance benefit with the <code class=\"language-text\">#id-name</code> selector over the <code class=\"language-text\">.class-name</code> selector</li>\n<li>reduces the reusability of the style rule since the <code class=\"language-text\">#id-name</code> element can only appear on the page once.</li>\n</ul>\n<p><strong>Why should I use a <code class=\"language-text\">.class-name</code> selector instead of a <code class=\"language-text\">tag-name</code> selector?</strong></p>\n<ul>\n<li>performance. a selector rule like <code class=\"language-text\">.widget-name div</code> can result in <em>really</em> poor performance. The CSS engine works from right-to-left, so every <code class=\"language-text\">&lt;div/&gt;</code> tag on the page must then be recursively checked to see if it is a child of an element matching <code class=\"language-text\">.widget-name</code>.  This can end up being wildly problematic for large pages.</li>\n<li>harder to read.  The meaning behind a rule set for <code class=\"language-text\">.img-carousel &gt; p</code> is much harder to reason about than <code class=\"language-text\">.img-carousel .caption</code></li>\n</ul>\n<p>Of course, where there are rules, there are exceptions to that rule. This are good guidelines to follow, but there may be situations where it does not hold true.</p>\n<h2>Using this pattern</h2>\n<hr>\n<p>Whenever writing new CSS, go through the following three steps:</p>\n<h3>Step #1: Decide what the boundaries of your “widget” is.</h3>\n<p>This may sound easy, but it’s actually perhaps the hardest part. I like to think of the widget as some sort of proper “unit” of web design.  Pretty much everything you design will be part of a widget, but the trick is deciding where one widget ends, and another begins.</p>\n<p>Roughly speaking, I think the “sweet spot” is to choose widgets such that the fully styled widget requires somewhere between 5 and 15 selectors to fully define it.  If it requires less than this, I think the widget may be too small or specific. If it requires more than this, you may want to break up some of the pieces of the “widget” into widgets of their own.</p>\n<h3>Step #2: Name your widget</h3>\n<p>This widget name should be <strong>descriptive</strong> and <strong>unique</strong>.  The descriptive part is pretty self explanatory.  The uniqueness part is a bit of a balancing act. I suggest using some sort of namespace convention here to more or less guarantee uniqueness. For instance, if we declared a namespace <code class=\"language-text\">.ns-</code> for all widgets, a widget might have a class <code class=\"language-text\">.ns-foo</code> or <code class=\"language-text\">.ns-bar</code>.</p>\n<h3>Step #3: Assign simple/semantic class names for any necessary child elements of the widget</h3>\n<p>Hopefully this step is somewhat self-explanatory.  Your widget is composed of parts. An <code class=\"language-text\">.ns-editor</code> editor widget would have an <code class=\"language-text\">.input</code> field, some <code class=\"language-text\">.buttons</code>, a <code class=\"language-text\">.preview</code> div, etc…  Make sure the class names rightfully explain the function of the element, and you will thank yourself later. In the short term, be thankful that because of this patter you are now free to use clean and short class names instead of the <code class=\"language-text\">.long-and-crazy-specific-class-names</code> that you had to use before!</p>\n<h2>Conclusion</h2>\n<hr>\n<p>I’d love to hear any thoughts on where using this pattern and/or structure could run someone into trouble.  Generally speaking, I have found this pattern to be tremendously helpful, and result in the following goodness:</p>\n<ul>\n<li>high level of code reuse</li>\n<li>more performant CSS</li>\n<li>easy to refactor styles</li>\n<li>no unintentional style conflicts</li>\n<li>implicit level of code organization based on 1-file-per-widget</li>\n</ul>",
      "fields": { "readingTime": { "text": "8 min read" } },
      "frontmatter": {
        "title": "A pattern for writing CSS to scale",
        "date": "May 14, 2014"
      }
    }
  },
  "pageContext": {
    "slug": "/a-pattern-for-writing-css-to-scale/",
    "previous": {
      "fields": { "slug": "/hello-world/" },
      "frontmatter": { "title": "Lets look at some code" }
    },
    "next": {
      "fields": {
        "slug": "/building-an-image-uploading--resizing-framework-in-aspnet/"
      },
      "frontmatter": { "title": "Just text and links" }
    }
  }
}
