{
  "data": {
    "site": {
      "siteMetadata": {
        "title": "Intelligible Babble",
        "author": "Leland Richardson"
      }
    },
    "markdownRemark": {
      "id": "f57ba9cc-c45f-5dc6-b73b-81e0f92c05f2",
      "excerpt": "If you are a web developer (or if you’re not) and you haven’t had a chance to check out the new x-webkit-speech input that should now be…",
      "html": "<p>If you are a web developer (or if you’re not) and you haven’t had a chance to check out the new x-webkit-speech input that should now be accessible to HTML5 capable browsers (or is it webkit-based only?)</p>\n<p>If you haven’t seen it or used it on google’s home page (which, if you don’t use chrome, chances are you haven’t) then it is worth the <a href=\"http://chrome.google.com\">chrome download</a> just to try it out.  At least I think so.  The basic idea is now with adding just the following html to your webpage:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;input id=&quot;speechInput&quot; type=&quot;text&quot; x-webkit-speech /&gt;</code></pre></div>\n<p>You have successfully created a text input on a webpage, just like it would have before, except now it has a nifty little mic icon on the right side of it, which when clicked will immediately tap into your microphone and wait for you to “utter” a word, phrase, or sentence even - and then transcribe it and place it right inside the text box.  Pretty cool, eh?</p>\n<p>Not only will this recognize what us English-speaking web surfers are saying, but it apparently automatically recognizes what language you are speaking in - without even needing to speek more than a single word or phrase! Obviously, a task such as speech recognition, especially multi-lingual speech recognition, has been something that has been difficult for quite some time - and requires a lot of linguistic data in order to function properly.  Something like this cannot be processed client-side, and must be passed onto a server.</p>\n<p>So far this client-to-server communication is occurring through the actual user-agent, rather than the browser client.  This is very likely necessary as a result of security reasons - some of which are outlined in <a href=\"http://www.w3.org/2005/Incubator/htmlspeech/2010/10/google-api-draft.html\">Google’s draft on the API</a></p>\n<p>Either way, this little input element has generated a bit of buzz lately as several curious fellows decided to dissect how this thing works. Turns out, google has exposed (at least for now) an API at the following URI which one can post to with whatever HTTP client he/she wants to:</p>\n<blockquote>\n<p><a href=\"https://www.google.com/speech-api/v1/recognize\">https://www.google.com/speech-api/v1/recognize</a></p>\n</blockquote>\n<p>It seems that most found this URI most easily by navigating through <a href=\"http://src.chromium.org/viewvc/chrome/trunk/src/content/browser/speech/speech_recognition_request.cc?content-type=text/plain\">Chromium source code</a> to find where the open-sourced browser manages to turn our mumbles into text. Several people have already managed to get this working in several languages, and some have even created wrappers.  For instance, over at Github there is a <a href=\"https://github.com/taf2/speech2text\">speech2text Ruby Wrapper</a> which interfaces with this API.  Similarly, <a href=\"http://mikepultz.com/2011/03/accessing-google-speech-api-chrome-11/\">Mike Pultz’s Article</a> and <a href=\"http://fennb.com/fast-free-speech-recognition-using-googles-in\">Fenn Bailey’s Article</a> show how to use Perl and Sox to easily create the audio to the right specifications and send it off.</p>\n<p>Fenn’s article goes into a bit of detail showing how to use SoX to properly normalize and clean up the audio into the best format for the API to recognize the speech in.</p>\n<p>The API returns several possible interpretations of the speech, along with its confidence levels:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">{\n    &quot;hypotheses&quot;: [\n        {\n            &quot;confidence&quot;: 0.88569070000000005, \n            &quot;utterance&quot;: &quot;this is pretty cool&quot;\n        }, \n        {\n            &quot;utterance&quot;: &quot;thesis pretty cool&quot;\n        }, \n        {\n            &quot;utterance&quot;: &quot;this is spirit cool&quot;\n        }, \n        {\n            &quot;utterance&quot;: &quot;this ease pretty cool&quot;\n        }, \n        {\n            &quot;utterance&quot;: &quot;this is pretty kool&quot;\n        }\n    ], \n    &quot;id&quot;: &quot;48e33aa5b2e21889c66f69ae492307b7-1&quot;, \n    &quot;status&quot;: 0\n}</code></pre></div>\n<p><a href=\"http://fennb.com/fast-free-speech-recognition-using-googles-in\">Source</a></p>\n<p>I’m only wondering how long it will take to get a wrapper of this in every major programming language out there.  Google has done us a good one and made it super-easy to put this form of data input in any web application of our choosing - but it would still be nice to have the same capabilities in any desktop application, yah?</p>\n<p>If one doesn’t come out soon, I may spend some time building some clean UI controls for .NET or Java that replicate the x-webkit-speech input.</p>\n<p>Or, since Windows 8 is going to use HTML5 ANYWAY, does it really matter???</p>",
      "fields": { "readingTime": { "text": "4 min read" } },
      "frontmatter": {
        "title": "Free Google Speech Recognition API",
        "date": "August 16, 2011"
      }
    }
  },
  "pageContext": {
    "slug": "/_free-google-speech-recognition-api/",
    "previous": {
      "fields": {
        "slug": "/generic-method-to-safely-perform-cross-thread-invoke/"
      },
      "frontmatter": {
        "title": "Generic Method to Safely Perform Cross-Thread Invoke"
      }
    },
    "next": {
      "fields": {
        "slug": "/_using-html5-data--tags-with-razor-and-c-anonymous-objects/"
      },
      "frontmatter": {
        "title": "Using HTML5 data-* tags with Razor and C# Anonymous Objects"
      }
    }
  }
}
